cmsis-svd/cmsis-svd/data/HDSC/HC32L150KX.svd
                <register>
                    <name>IRQ17PEND</name>
                    <description>desc IRQ17PEND</description>
                    <addressOffset>0x58</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>MSC5INT</name>
                            <description>desc MSC5INT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ18PEND</name>
                    <description>desc IRQ18PEND</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>MSC5INT0</name>
                            <description>desc MSC5INT0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MSC5INT1</name>
                            <description>desc MSC5INT1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ19PEND</name>
                    <description>desc IRQ19PEND</description>
                    <addressOffset>0x60</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>MSC6INT</name>
                            <description>desc MSC6INT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ20PEND</name>
                    <description>desc IRQ20PEND</description>
                    <addressOffset>0x64</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>MSC6INT0</name>
                            <description>desc MSC6INT0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MSC6INT1</name>
                            <description>desc MSC6INT1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ24PEND</name>
                    <description>desc IRQ24PEND</description>
                    <addressOffset>0x74</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE3</resetMask>
                    <fields>
                        <field>
                            <name>MOSCI</name>
                            <description>desc MOSCI</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SOSCI</name>
                            <description>desc SOSCI</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RTCI</name>
                            <description>desc RTCI</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RAMI</name>
                            <description>desc RAMI</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ25PEND</name>
                    <description>desc IRQ25PEND</description>
                    <addressOffset>0x78</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x11</resetMask>
                    <fields>
                        <field>
                            <name>ADCCNVI</name>
                            <description>desc ADCCNVI</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADCCMPI</name>
                            <description>desc ADCCMPI</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ26PEND</name>
                    <description>desc IRQ26PEND</description>
                    <addressOffset>0x7C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x20</resetMask>
                    <fields>
                        <field>
                            <name>VCI</name>
                            <description>desc VCI</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ27PEND</name>
                    <description>desc IRQ27PEND</description>
                    <addressOffset>0x80</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x40</resetMask>
                    <fields>
                        <field>
                            <name>ICCI</name>
                            <description>desc ICCI</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ31PEND</name>
                    <description>desc IRQ31PEND</description>
                    <addressOffset>0x90</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x800FFFF</resetMask>
                    <fields>
                        <field>
                            <name>CTIIRQ0CH0</name>
                            <description>desc CTIIRQ0CH0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTIIRQ1CH0</name>
                            <description>desc CTIIRQ1CH0</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTIIRQ0CH1</name>
                            <description>desc CTIIRQ0CH1</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTIIRQ1CH1</name>
                            <description>desc CTIIRQ1CH1</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTIIRQ0CH2</name>
                            <description>desc CTIIRQ0CH2</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTIIRQ1CH2</name>
                            <description>desc CTIIRQ1CH2</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTIIRQ0CH3</name>
                            <description>desc CTIIRQ0CH3</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTIIRQ1CH3</name>
                            <description>desc CTIIRQ1CH3</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTIIRQ0CH4</name>
                            <description>desc CTIIRQ0CH4</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTIIRQ1CH4</name>
                            <description>desc CTIIRQ1CH4</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTIIRQ0CH5</name>
                            <description>desc CTIIRQ0CH5</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTIIRQ1CH5</name>
                            <description>desc CTIIRQ1CH5</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTIIRQ0CH6</name>
                            <description>desc CTIIRQ0CH6</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTIIRQ1CH6</name>
                            <description>desc CTIIRQ1CH6</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTIIRQ0CH7</name>
                            <description>desc CTIIRQ0CH7</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTIIRQ1CH7</name>
                            <description>desc CTIIRQ1CH7</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FLASHI</name>
                            <description>desc FLASHI</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
